# 8. Select Data (iloc)

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [4]:
df.iloc[0] # 0th person's data

name        Sally
school      Biola
height        157
English        97
Math           89
Science        88
SWskills      C++
Name: 1st, dtype: object

In [5]:
df.iloc[0:3] # 0 ~ 2nd person's data

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java

In [6]:
df.iloc[0, 1] # 0th person's 1st(school) data

'Biola'

In [7]:
 df.iloc[[0, 1], 2] # 0th & 1st person's 2nd(height) data

Sib. #
1st    157
2nd    173
Name: height, dtype: int64

In [8]:
df.iloc[0:3, 2:5]

        height  English  Math
Sib. #
1st        157       97    89
2nd        173       78   100
3rd        175       95    78